gpu/rapidcfd/cases/uvg06v3_p100_b10_ti_a20/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    wing
    {
        type triSurfaceMesh;
        file "wing.stl";
    }
    vanes
    {
        type triSurfaceMesh;
        file "vanes.stl";
    }

    // Near-field and wake boxes (axis-aligned because alpha is baked into
    // the rotated STL, never into the domain).
    boxNear { type searchableBox; min (-0.5 -0.6 -1); max ( 1.4  0.6 1); }
    boxWake { type searchableBox; min (-0.9 -1.0 -1); max ( 3.6  1.0 1); }
}

castellatedMeshControls
{
    maxLocalCells       4000000;
    maxGlobalCells      12000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    features
    (
        { file "wing.eMesh"; level 6; }
    );

    refinementSurfaces
    {
        wing
        {
            // L5-L6 on the skin: 3.1 down to 1.56 mm in x/y (half that in
            // z, the background cell is flatter); curvature picks L6.
            level (5 6);
            patchInfo { type wall; }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        wing
        {
            // Distance bands off the skin: keeps the boundary-layer
            // neighbourhood at L6 and the near-field at L5.
            mode distance;
            levels ((0.012 6) (0.05 5));
        }
        // Sub-mm band hugging the vane plates: L8 ~ 0.39 mm within 1.5 mm,
        // L7 within 4 mm - resolves plate-edge vortex roll-up, the actual
        // VG mechanism the LBM arm could never reach.
        vanes
        {
            mode distance;
            levels ((0.0015 8) (0.004 7));
        }
        boxNear { mode inside; levels ((1e15 4)); }
        boxWake { mode inside; levels ((1e15 3)); }
    }

    locationInMesh (-2.0 -1.0 0.0001);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      50;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes   false;

    layers
    {
        // Layers grow on every wing-derived patch (vanes included; snappy
        // collapses them locally where the thin plates pinch).
        "wing.*"
        {
            nSurfaceLayers 5;
        }
    }

    // Absolute sizing: first cell 0.4 mm puts y+ ~ 35-45 at Re 2.2e6 -
    // squarely in the wall-function log-layer window.
    firstLayerThickness 4.0e-4;
    expansionRatio      1.25;
    minThickness        5.0e-5;

    nGrow               0;
    featureAngle        130;
    slipFeatureAngle    30;
    nRelaxIter          5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    // Both spellings: 2.x reads minMedianAxisAngle, v2506 minMedialAxisAngle;
    // each vintage ignores the key it does not know.
    minMedianAxisAngle  90;
    minMedialAxisAngle  90;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}

debug 0;
mergeTolerance 1e-6;
